# 19.16 Описати метаклас PoolMeta, який дозволяє відслідковувати, що
# кількість об’єктів певного класу не перевищує n. При спробі створити (n+1)
# об’єкт, у якості результату повертається перший створений об’єкт, далі –
# другий тощо.
# Використати цей метаклас для розв’язання задачі. Деякий клас дозволяє
# зберігати та обробляти інформацію про інцидент (назва, тип, опис, час
# виникнення, заходи тощо). Одночасно на екрані не може розміщуватись
# більш, ніж 9 інцидентів. Забезпечити одночасне знаходження у пам’яті тільки
# 9 інцидентів (в той же час інформація про всі інциденти повинна зберігатись у
# текстовому файлі).